In [1]:
import pandas as pd

In [ ]:
document_path = './bank-full.xlsx'

dataframe = pd.read_excel(document_path, sheet_name='Sheet 1 - bank-full')

In [7]:
dataframe.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown

### Método values_counts

> Não poucas vezes precisaremos saber a frequência com que uma dada informação
se repete. Para obter tal informação de uma dada variável no Pandas podemos
utilizar a função pd.value_counts().

In [9]:
dataframe['job'].value_counts()

job
blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: count, dtype: int64

### Outros métodos

- pd.mean() -> Calcular a média
- pd.sum() -> Calcular a soma de uma coluna
- pd.max() -> Identificar o maior valor de uma coluna
- pd.min() -> Identificar o menor valor de uma coluna
- pd.count() -> Contava a quantidade de registros de uma coluna

In [10]:
# Forma de especificar uma coluna no pandas
dataframe.balance.mean()

1362.2720576850766

In [11]:
# Somar valores de mais de uma coluna
dataframe[[ 'balance', 'duration' ]].sum()

balance     61589682
duration    11671811
dtype: int64

### Unique

> Outra importante função é a pd.unique(), que nos mostra todos os valores únicos em
uma dada variável.

In [14]:
# Listar os elementos únicos de uma coluna
# Remove as duplicadas e retorna os elementos únicos

dataframe.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

### Nunique

> Já a função pd.nunique() nos mostra a quantidade de valores únicos em uma
variável.

In [15]:
# Este comando retorna a quantidade de elementos únicos existentes em uma coluna

dataframe.job.nunique()

12

### Duplicates

> Outra importante ação ao analisar dados, é verificar se há duplicidade nas
informações, evitando assim que tiremos conclusões errôneas sobre os dados. Para
verificar a existência de duplicidade, podemos usar a função pd.duplicated() e
pd.sum().

In [17]:
# Calcular a quantidade de registro duplicados em uma tabela

dataframe.duplicated().sum()

0

In [18]:
# Calcular a quantidade de registro duplicatos em uma coluna

dataframe.job.duplicated().sum()

45199

In [19]:
# Exibir quais linhas são duplicadas

dataframe[dataframe.job.duplicated() == True]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
5,35,management,married,tertiary,no,231,yes,no,unknown,5,may,139,1,-1,0,unknown
6,28,management,single,tertiary,no,447,yes,yes,unknown,5,may,217,1,-1,0,unknown
7,42,entrepreneur,divorced,tertiary,yes,2,yes,no,unknown,5,may,380,1,-1,0,unknown
9,43,technician,single,secondary,no,593,yes,no,unknown,5,may,55,1,-1,0,unknown
11,29,admin.,single,secondary,no,390,yes,no,unknown,5,may,137,1,-1,0,unknown
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other

### Dados nulos ou faltantes

> Dados faltantes ou nulos podem enviesar as análises, por isso é sempre importante
eliminá-los ou substituí-los (de acordo com o contexto de análise).

> Uma maneira de saber a quantidade de dados faltantes é utilizando a função pd.isna
ou pd.isnull com a função pd.sum().

In [20]:
dataframe.isna().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
dtype: int64

> Para criar um novo dataframe sem os dados faltantes ou nulos, utilizamos a função
pd.dropna().

In [ ]:
dataframe_data_removed = dataframe.dropna()

> Quando for necessário substituir os dados faltantes por um novo valor, podemos
usar a função pd.fillna().

In [ ]:
dataframe_update_data = dataframe.fillna('Desconhecido')